namespace Rep
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.OutputEncoding = System.Text.Encoding.UTF8;
            Console.WriteLine("Книжкова лікарня");
            Console.WriteLine("1. Книга 1");
            Console.WriteLine("2. Книга 2");
            Console.WriteLine("3. Книга 2");
            Console.Write("Оберіть книгу: ");
            int choice = Convert.ToInt32(Console.ReadLine());

            switch (choice)
            {
                case 1:
                    {
                        Console.WriteLine("У Книжковій лікарні пахло старим папером, сушеною лавандою та якісним клеєм. Старий палітурник Михайло Іванович одягнув окуляри й обережно поклав на стіл нового «пацієнта» — казку про загубленого принца. Книга була в жахливому стані: корінець розірваний, а сторінки пожовкли від чиїхось сліз. Михайло Іванович акуратно розрівняв зім'яті куточки, підклеїв сторінки прозорою стрічкою та зшив аркуші міцною ниткою. Наостанок він змастив обкладинку спеціальним воском. Книга засяяла, наче нова. Михайло посміхнувся: тепер цей принц точно знайде дорогу додому в руках нового читача.");
                        break;
                    }
                case 2:
                    {
                        Console.WriteLine("Дев'ятикласник Денис приніс до шкільної «Книжкової лікарні» товстий англо-український словник. Книга буквально розсипалася в руках — нею користувалися кілька поколінь учнів. Разом із бібліотекаркою вони влаштували справжню «операцію». Денис зачищав старий засохлий клей наждачним папером, а пані Олена наносила свіжий шар еластичного полімеру. Вони затиснули словник у великі лещата на добу. Наступного дня книга відкривалася з приємним хрускотом, готова служити ще не один десяток років. Денис зрозумів, що лікувати книги — це теж мистецтво.");
                        break;
                    }
                case 3:
                    {
                        Console.WriteLine("У 2085 році, коли весь світ перейшов на голографічні чипи, «Книжкова лікарня» на околиці міста здавалася музеєм. Сюди привозили паперові реліквії з усього світу. Робот-реставратор на ім'я АР-3 обережно сканував лазером пошкоджені часом сторінки «Маленького принца». Його маніпулятори з точністю до мікрона відновлювали втрачені молекули паперу та зблідле чорнило. «Навіщо ти їх лікуєш? На чипах зручніше», — запитав один із відвідувачів. Робот замерз на секунду, а потім відповів електронним, але теплим голосом: «Чипи зберігають інформацію. А ці пацієнти зберігають душу тих, хто їх тримав».");
                        break;
                    }
                default:
                    {
                        Console.WriteLine("Невідома функція.");
                        break;
                    }

            }
        }
    }
}
