namespace Rep
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Книжкова лікарня");
            Console.WriteLine("1. Книга 1");
            Console.WriteLine("2. Книга 2");
            Console.WriteLine("3. Книга 2");
            Console.Write("Оберіть книгу: ");
            int choice = Convert.ToInt32(Console.ReadLine());

            switch (choice)
            {
                case 1:
                    {
                        Console.WriteLine("У Книжковій лікарні пахло старим папером, сушеною лавандою та якісним клеєм. Старий палітурник Михайло Іванович одягнув окуляри й обережно поклав на стіл нового «пацієнта» — казку про загубленого принца. Книга була в жахливому стані: корінець розірваний, а сторінки пожовкли від чиїхось сліз. Михайло Іванович акуратно розрівняв зім'яті куточки, підклеїв сторінки прозорою стрічкою та зшив аркуші міцною ниткою. Наостанок він змастив обкладинку спеціальним воском. Книга засяяла, наче нова. Михайло посміхнувся: тепер цей принц точно знайде дорогу додому в руках нового читача.");
                        break;
                    }

            }
        }
    }
}
